CSI API ETABS v1
cPointObj.SetMassByWeight Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMassByWeight(
	string Name,
	ref double[] M,
	eItemType ItemType = eItemType.Objects,
	bool IsLocalCSys = true,
	bool Replace = false
)
Function SetMassByWeight (
	Name As String,
	ByRef M As Double(),
	Optional ItemType As eItemType = eItemType.Objects,
	Optional IsLocalCSys As Boolean = true,
	Optional Replace As Boolean = false
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim M As Double()
Dim ItemType As eItemType
Dim IsLocalCSys As Boolean
Dim Replace As Boolean
Dim returnValue As Integer
returnValue = instance.SetMassByWeight(Name,
	M, ItemType, IsLocalCSys, Replace)
int SetMassByWeight(
	String^ Name,
	array<double>^% M,
	eItemType ItemType = eItemType::Objects,
	bool IsLocalCSys = true,
	bool Replace = false
)
abstract SetMassByWeight :
        Name : string *
        M : float[] byref *
        ?ItemType : eItemType *
        ?IsLocalCSys : bool *
        ?Replace : bool
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
        let _IsLocalCSys = defaultArg IsLocalCSys true
        let _Replace = defaultArg Replace false
*)
-> int
Parameters
Name
Type: System.String
M
Type: System.Double[]
ItemType (Optional)
Type: ETABSv1.eItemType
IsLocalCSys (Optional)
Type: System.Boolean
Replace (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace